Repository: Kostenkov-2021/viewNetworks
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: pt_pt, ru

source: Enter the network name:
pt_pt: Digite o nome da rede:
ru: Введите имя сети:

source: Key content:
pt_pt: Conteúdo da chave:
ru: Ключ:

source: &Search
pt_pt: &Pesquisar
ru: &Поиск

source: C&lean
pt_pt: Limpar
ru: О&чистить

source: &Close
pt_pt: Fechar
ru: &Закрыть

source: Could not find key content for network {nameWiFi}!
pt_pt: Não foi possível encontrar o conteúdo principal da rede {nameWiFi}!

source: Attention
pt_pt: Atenção
ru: Предупреждение

source: Error retrieving network information for {nameWiFi}: {str(e)}
pt_pt: Erro ao recuperar informações de rede para {nameWiFi}: {str(e)}

source: netsh command not found. Ensure you are running on a supported Windows environment.
pt_pt: comando netsh não encontrado. Certifique-se de estar executando em um ambiente Windows compatível.
ru: команда netsh не найдена. Убедитесь, что вы работаете в совместимой среде Windows.

source: Error
pt_pt: Erro
ru: Ошибка

source: An unexpected error occurred: {str(e)}
pt_pt: Ocorreu um erro inesperado: {str(e)}

source: Message
pt_pt: Mensagem
ru: Сообщение

source: &Network Profiles
pt_pt: perfis de rede
ru: профили сетей

source: &Recover Password
pt_pt: &Recuperar senha
ru: &Восстановить пароль

source: Displays the networks you have connected to.
pt_pt: Exibe as redes às quais você se conectou.
ru: Показывает список сетей, к которым вы подключались.

source: Network Profiles
pt_pt: Perfis de rede
ru: Профили сетей

source: Recover saved networks password.
pt_pt: Recupere a senha de redes salvas.
ru: Восстанавливает пароль сохранённых сетей.

source: Recover Password.
pt_pt: Recuperar senha.
ru: Восстановить пароль.

source: An instance of {} is already open.
pt_pt: Uma instância de {} já está aberta.
ru: Экземпляр {} уже открыт.

source: Error fetching networks:
pt_pt: Erro ao buscar redes:
ru: Ошибка поиска сетей:

source: List networks and recover password.
pt_pt: Liste redes e recupere a senha.
ru: Предоставляет список сетей и восстанавливает пароль.

source: This addon lists the networks that have been saved on this system and tries when possible to recover the password.
pt_pt: Este addon lista as redes que foram salvas neste sistema e tenta quando possível recuperar a senha.
ru: Это дополнение предоставляет список сетей, которые были сохранены в вашей системе, и пытается, когда это возможно, восстановить пароль.

source: Implemented internal code optimizations and menu restructuring.
pt_pt: Implementou otimizações internas de código e reestruturação do menu.
ru: Реализована внутренняя оптимизация кода и реструктуризация меню.
